#include <stdio.h>
#pragma warning(disable : 4996)
void fun(int* dt0, int* n0, int x) {
    int i, j;
    /**********************found***********************/
    i = 0;  // 改为 0，用于遍历数组 dt0
    j = 0;  // 改为 0，用于记录不等于形参 x 的数据的个数
    do {
        /**********************found***********************/
        if (dt0[i] != x) {  // 改为 !=，题目要求不等于形参 x 的数据
            dt0[j] = dt0[i];
            j++;
        }
        i++;
    } while (i < *n0);
    /**********************found***********************/
    *n0 = j;  // 题目要求通过形参 n0 返回数据的个数
}
main() {
    int d[10] = {2, 5, 6, 7, 2, 4, 5, 2, 2, 6}, n = 10, i;
    fun(d, &n, 2);
    for (i = 0; i < n; i++)
        printf("%d ", d[i]);
    printf("\n");
}